FGI.L.ruRU = {}
local L = FGI.L.ruRU
L["1 день"] = "1 день"
L["1 месяц"] = "1 месяц"
L["1 неделя"] = "1 неделя"
L["6 месяцев"] = "6 месяцев"
L["blacklist"] = "/fgi blacklist <Имя> - <Причина> - Добавить игрока в черный список"
L["blacklistAdd"] = "!blacklistAdd <Имя> - <Причина> - добавить игрока в черный список"
L["blacklistDelete"] = "!blacklistDelete <Имя> - <Причина> - удалить игрока из черного списка"
L["blacklistGetList"] = "!blacklistGetList - получить список игроков в черным списке"
L["BloodElf"] = "Эльфийка крови"
L["c-"] = "к-"
L["commandList"] = "В офицерском канале доступны следующие команды:"
L["DarkIronDwarf"] = "Дворфийка из клана Черного Железа"
L["defaultReason"] = "Причины нет"
L["Draenei"] = "Дренейка"
L["Dwarf"] = "Дворфийка"
L["factorySettings"] = "/fgi factorySettings - Полный сброс базы данных аддона"
L["fgi"] = "!fgi - список доступных команд"
L["filter"] = [=[ЛКМ - Включить/Выключить
ПКМ - Изменить
Shift+ЛКМ - Удалить

]=]
L["filterTooltip"] = [=[Имя фильтра: %s
Состояние:%s
Фильтр имени: %s
Диапазон уровней: %s
Фильтр повторений в имени:%d:%d
Классы: %s
Расы: %s
Количество срабатываний фильтра:%d]=]
L["Gnome"] = "Гномка"
L["help2"] = "/fgi help2 - Команды с префиксом \"!\""
L["HightmountainTauren"] = "Тауренка Крутогорья"
L["intro"] = "|cff00ff96Команды с префиксом \"|cffff0000!|r|cff00ff96\" созданы для офицеров у которых не установлен аддон, эти команды могут быть использованы только в офицерском канале.|r"
L["invite"] = "/fgi invite - Пригласить первого игрока из очереди"
L["KulTiran"] = "Култираска"
L["LightforgedDraenei"] = "Озаренная дренейка"
L["MagharOrc"] = "Маг'харка"
L["Mechagnome"] = "Механогномка"
L["minimap"] = [=[ЛКМ - пригласить
ПКМ - открыть главное окно
Shift+ЛКМ - пауза/продолжить

Очередь: %d
Прогресс: %s]=]
L["nextSearch"] = "/fgi nextSearch - Запустить следующее сканирование"
L["Nightborne"] = "Ночнорожденная"
L["NightElf"] = "Ночная эльфийка"
L["Orc"] = "Орчиха"
L["Pandaren"] = "Пандаренка"
L["r-"] = "р-"
L["resetDB"] = "/fgi resetDB - Очистить список отправленных приглашений."
L["resetWindowsPos"] = "/fgi resetWindowsPos - Сбросить позиции окон."
L["show"] = "/fgi show - Открыть главное окно аддона"
L["Tauren"] = "Тауренка"
L["unblacklist"] = "/fgi unblacklist <Имя> - Удалить игрока из черного списка"
L["VoidElf"] = "Эльфийка Бездны"
L["ZandalariTroll"] = "Зандаларка"
L["Автоматическое увеличение детализации поиска"] = "Автоматическое увеличение детализации поиска"
L["Автор"] = "Автор"
L["Безопасность"] = "Безопасность"
L["Благодарности"] = "Благодарности"
L["Быстрое добавление в черный список"] = "Быстрое добавление в черный список"
L[ [=[Введите диапазон уровней для фильтра.
Например: %s55%s:%s58%s
будут подходить только те игроки, уровень
которых варьируется от %s55%s до %s58%s (включительно)]=] ] = [=[Введите диапазон уровней для фильтра.
Например: %s55%s:%s58%s
будут подходить только те игроки, уровень
которых варьируется от %s55%s до %s58%s (включительно)]=]
L[ [=[Введите максимальное количество последовательных
гласных и согласных, которое может содержать имя игрока.
Например: %s3%s:%s5%s
Будет означать, что игроки с более чем %s3%s гласными подряд
или более %s5%s согласными подряд не будут добавлены в очередь.]=] ] = [=[Введите максимальное количество последовательных
гласных и согласных, которое может содержать имя игрока.
Например: %s3%s:%s5%s
Будет означать, что игроки с более чем %s3%s гласными подряд
или более %s5%s согласными подряд не будут добавлены в очередь.]=]
L["Вкл/Выкл"] = "Вкл/Выкл"
L["вкл/выкл"] = "вкл/выкл"
L["Включен"] = "Включен"
L["Включить фильтры"] = "Включить фильтры"
L["Время запоминания игрока"] = "Время запоминания игрока"
L["Все"] = "Все"
L["Вы можете перемещать окно за его фон и закрыть его двойным кликом."] = "Вы можете перемещать окно за его фон и закрыть его двойным кликом."
L["Вы не состоите в гильдии или у вас нет прав для приглашения."] = "Вы не состоите в гильдии или у вас нет прав для приглашения."
L["Вы уверены?"] = "Вы уверены?"
L["Выберите сообщение"] = "Выберите сообщение"
L["Выбрать приглашения"] = "Выбрать приглашения"
L["Выключен"] = "Выключен"
L["Выключить отправляемые сообщения"] = "Выключить отправляемые сообщения"
L["Выключить системные сообщения"] = "Выключить системные сообщения"
L["Выключить сообщения аддона"] = "Выключить сообщения аддона"
L["Да"] = "Да"
L["Данные для синхронизации"] = "Данные для синхронизации"
L["Данные для синхронизации не выбраны"] = "Данные для синхронизации не выбраны"
L["Данные игрока"] = "Данные игрока"
L["Данные синхронизированы с игроком %s."] = "Данные синхронизированы с игроком %s."
L["Диапазон уровней"] = "Диапазон уровней"
L["Диапазон уровней (Мин:Макс)"] = "Диапазон уровней (Мин:Макс)"
L["Для изменения значений используйте колесо мыши"] = "Для изменения значений используйте колесо мыши"
L["Добавить"] = "Добавить"
L["Добавить фильтр"] = "Добавить фильтр"
L["Добавлять кнопки аддона в выпадающее меню"] = "Добавлять кнопки аддона в выпадающее меню"
L["Дополнительные настройки сканирования"] = "Дополнительные настройки сканирования"
L["Другая помощь"] = "Другая помощь"
L[ [=[Если имя игрока содержит введенную
фразу, он не будет добавлен в очередь]=] ] = [=[Если имя игрока содержит введенную
фразу, он не будет добавлен в очередь]=]
L["Заголовок окна"] = "Заголовок окна"
L["Заметка для новых игроков"] = "Заметка для новых игроков"
L["Заметка для офицеров для новых игроков"] = "Заметка для офицеров для новых игроков"
L["Записывать игрока в базу данных даже если приглашение не было отправлено"] = "Записывать игрока в базу данных даже если приглашение не было отправлено"
L["Записывать игрока в базу данных сразу после нахождения"] = "Записывать игрока в базу данных сразу после нахождения"
L["Запоминать всех игроков"] = "Запоминать всех игроков"
L["Запрос синхронизации у: %s. %d"] = "Запрос синхронизации у: %s. %d"
L["Запрос: %s. Поиск вернул игроков: %d"] = "Запрос: %s. Поиск вернул игроков: %d"
L["Запускать в фоновом режиме"] = "Запускать в фоновом режиме"
L["Запускать поиск в фоновом режиме"] = "Запускать поиск в фоновом режиме"
L["Игнорировать"] = "Игнорировать"
L["Игрок %s добавлен в черный список."] = "Игрок %s добавлен в черный список."
L["Игрок %s найденный в черном списке, находится в вашей гильдии!"] = "Игрок %s найденный в черном списке, находится в вашей гильдии!"
L["Игрок %s не найден в черном списке"] = "Игрок %s не найден в черном списке"
L["Игрок %s удален из черного списка"] = "Игрок %s удален из черного списка"
L[ [=[Игрок %s хочет синхронизировать %s.
Разрешить?]=] ] = [=[Игрок %s хочет синхронизировать %s.
Разрешить?]=]
L["Игрок для синхронизации"] = "Игрок для синхронизации"
L["Игрок для синхронизации не выбран"] = "Игрок для синхронизации не выбран"
L["Игрок не добавлен в список исключений."] = "Игрок не добавлен в список исключений."
L["Игроков найдено: %d"] = "Игроков найдено: %d"
L["Имя"] = "Имя"
L["Имя фильтра"] = "Имя фильтра"
L["Имя фильтра занято"] = "Имя фильтра занято"
L["Имя фильтра не может быть пустым"] = "Имя фильтра не может быть пустым"
L["Интервал"] = "Интервал"
L["Использовать пользовательский список запросов"] = "Использовать пользовательский список запросов"
L["Категория"] = "Категория"
L["Классы:"] = "Классы:"
L["Количество ошибок: %d"] = "Количество ошибок: %d"
L["Количество уровней сканируемых за один раз"] = "Количество уровней сканируемых за один раз"
L["Контакт"] = "Контакт"
L["Логи"] = "Логи"
L["Максимальное количество фильтров %s. Пожалуйста измените или удалите имеющийся фильтр."] = "Максимальное количество фильтров %s. Пожалуйста измените или удалите имеющийся фильтр."
L["Нажмите на фильтр для изменения состояния"] = "Нажмите на фильтр для изменения состояния"
L["Назначить клавишу для приглашения"] = "Назначить клавишу для приглашения"
L["Назначить клавишу следующего поиска"] = "Назначить клавишу следующего поиска"
L["Назначить кнопку (%s)"] = "Назначить кнопку (%s)"
L["Настроить интерфейс"] = "Настроить интерфейс"
L["Настроить сообщения"] = "Настроить сообщения"
L["Настройка сообщений, подсказка"] = [=[Автоматическая замена.
NAME - имя игрока, которому отправляется сообщение.
GUILD - имя вашей гильдии
GUILDLINK - ссылка гильдии.]=]
L["Настройки"] = "Настройки"
L["Начало синхронизации"] = "Начало синхронизации"
L["Начать сканирование"] = "Начать сканирование"
L["Не отображать в чате отправляемые сообщения"] = "Не отображать в чате отправляемые сообщения"
L["Не отображать в чате системные сообщения"] = "Не отображать в чате системные сообщения"
L["Не отображать в чате сообщения аддона"] = "Не отображать в чате сообщения аддона"
L["Не отображать значок у миникарты"] = "Не отображать значок у миникарты"
L["Не отображать окно ввода причины для черного списка"] = "Не отображать окно ввода причины для черного списка"
L["Невозможно выполнить действие."] = "Невозможно выполнить действие."
L["Невозможно создать ссылку гильдии. Откройте окно гильдии и попробуйте снова. Если проблема не устранена, вероятно вы не можете создавать ссылку гильдии."] = "Невозможно создать ссылку гильдии. Откройте окно гильдии и попробуйте снова. Если проблема не устранена, вероятно вы не можете создавать ссылку гильдии."
L["Нельзя добавить пустое сообщение"] = "Нельзя добавить пустое сообщение"
L["Нельзя сохранить пустое сообщение"] = "Нельзя сохранить пустое сообщение"
L["Неправильный шаблон"] = "Неправильный шаблон"
L["Нет"] = "Нет"
L["Обычный поиск"] = "Обычный поиск"
L["Обязательное поле \"Имя фильтра\", пустые текстовые поля не используются при фильтрации."] = "Обязательное поле \"Имя фильтра\", пустые текстовые поля не используются при фильтрации."
L["Откл."] = "Откл."
L["Отклонить"] = "Отклонить"
L["Отключить"] = "Отключить"
L["Отправить запрос"] = "Отправить запрос"
L["Отправить сообщение и пригласить"] = "Отправить сообщение и пригласить"
L["Ошибка типа синхронизации"] = "Ошибка типа синхронизации"
L["Панель кнопок"] = "Панель кнопок"
L["Перевод"] = "Перевод"
L["Подтверждение отправки данных синхронизации"] = "Подтверждение отправки данных синхронизации"
L["Поиск вернул 50 или более результатов, рекомендуется изменить настройки поиска. Запрос: %s"] = "Поиск вернул 50 или более результатов, рекомендуется изменить настройки поиска. Запрос: %s"
L["Поиск разблокирован"] = "Поиск разблокирован"
L["Показывать в чате текущий запрос"] = "Показывать в чате текущий запрос"
L["Поле может содержать только буквы"] = "Поле может содержать только буквы"
L["Полоса прогресса"] = "Полоса прогресса"
L["Пользовательский список"] = "Пользовательский список"
L["Превышен лимит ожидания ответа"] = "Превышен лимит ожидания ответа"
L["Превышен лимит символов. Максимальная длина сообщения 255 символов. Длина сообщения превышена на %d"] = "Превышен лимит символов. Максимальная длина сообщения 255 символов. Длина сообщения превышена на %d"
L["Предпросмотр: %s"] = "Предпросмотр: %s"
L["Пригласить"] = "Пригласить"
L["Пригласить: %d"] = "Пригласить: %d"
L["Причина"] = "Причина"
L["Причина по умолчанию для черного списка"] = "Причина по умолчанию для черного списка"
L["Расширенное сканирование"] = "Расширенное сканирование"
L["Расы:"] = "Расы:"
L["Режим приглашения"] = "Режим приглашения"
L["Сбросить"] = "Сбросить"
L[ [=[Сбросить текущие поисковые запросы и результаты поиска.
Не забывайте сбрасывать поиск если вы изменили диапазон уровней или список поисковых запросов.]=] ] = [=[Сбросить текущие поисковые запросы и результаты поиска.
Не забывайте сбрасывать поиск если вы изменили диапазон уровней или список поисковых запросов.]=]
L["Синхронизация"] = "Синхронизация"
L[ [=[Синхронизация с %s.
%d/%d]=] ] = [=[Синхронизация с %s.
%d/%d]=]
L["Слово NAME заглавными буквами будет заменено на название вашей гильдии."] = "Слово NAME заглавными буквами будет заменено на название вашей гильдии."
L["Сообщать о добавлении в черный список в офицерский канал."] = "Сообщать о добавлении в черный список в офицерский канал"
L["Сообщение, если приглашение отклонено"] = "Сообщение, если приглашение отклонено"
L["Сохранить"] = "Сохранить"
L["Сохранить состояние поиска"] = "Сохранить состояние поиска"
L["Сохранить состояние поиска между сессиями"] = "Сохранить состояние поиска между сессиями"
L["Сочетание клавиш уже занято"] = "Сочетание клавиш уже занято"
L["Список отправленных приглашений"] = "Список отправленных приглашений"
L["Список приглашенных"] = "Список приглашенных"
L["Список фильтров"] = "Список фильтров"
L["Текущее сообщение: %s"] = "Текущее сообщение: %s"
L["Тестирование"] = "Тестирование"
L["Только пригласить"] = "Только пригласить"
L["Только сообщение"] = "Только сообщение"
L["Требовать подтверждение сброса поиска"] = "Требовать подтверждение сброса поиска"
L["Требуется перезагрузка интерфейса"] = "Требуется перезагрузка интерфейса"
L["Уведомление о готовности нового поиска"] = "Уведомление о готовности нового поиска"
L["Уведомление о найденных игроках"] = "Уведомление о найденных игроках"
L["Удалить"] = "Удалить"
L["Умный поиск"] = "Умный поиск"
L["Уровень, с которого начинается фильтр по классам"] = "Уровень, с которого начинается фильтр по классам"
L["Уровень, с которого начинается фильтр по расам"] = "Уровень, с которого начинается фильтр по расам"
L["Установить заметку для новых членов гильдии"] = "Установить заметку для новых членов гильдии"
L["Установить заметку для офицеров для новых членов гильдии"] = "Установить заметку для офицеров для новых членов гильдии"
L["Фильтр классов начало:"] = "Фильтр классов начало:"
L["Фильтр по имени"] = "Фильтр по имени"
L["Фильтр повторений в имени"] = "Фильтр повторений в имени"
L["Фильтр рас начало:"] = "Фильтр рас начало:"
L["Фильтры"] = "Фильтры"
L["Черный список"] = "Черный список"
L["Числа должны быть больше 0"] = "Числа должны быть больше 0"
L["Числа не могут быть меньше или равны 0. Минимальный уровень не может быть больше максимального"] = "Числа не могут быть меньше или равны 0. Минимальный уровень не может быть больше максимального"
L["Чтобы быть отфильтрованным, игрок должен соответствовать критериям ВСЕХ фильтров"] = "Чтобы быть отфильтрованным, игрок должен соответствовать критериям ВСЕХ фильтров"


L.synchBaseType = {
	"blacklist",
	"invitations",
}



L.settings = {
	size = {
		mainFrameW = 620,
		mainFrameH = 320,
		wheelHint = 250,
		inviteTypeGRP = 280,
		backgroundRun = 220,
		enableFilters = 150,
		startScan = 160,
		chooseInvites = 180,
		settingsBtn = 120,
		gratitude = 120,
		lvlRange = 150,
		searchInterval = 120,
		raceFilterStart = 160,
		classFilterStart = 160,
		settingsFrameW = 550,
		settingsFrameH = 260,
		addonMSG = 230,
		systemMSG = 245,
		sendMSG = 270,
		minimapButton = 260,
		createMenuButtons = 340,
		queueNotify = 260,
		searchAlertNotify = 300,
		blacklistOfficer = 450,
		rememberAll = 260,
		clearDBtimes = 150,
		confirmSearchClear = 300,
		blacklistReason = 300,
		fastBlacklist = 270,
		setNote = 200,
		saveSearch = 250,
		setOfficerNote = 290,
		filters = 150,
		keyBindingsW = 440,
		keyBindingsH = 150,
		keyBind = 200,
		setMSG = 160,
		filtersFrameW = 620,
		filtersFrameH = 300,
		addFilter = 150,
		addfilterFrameW = 600,
		addfilterFrameH = 600,
		messageFrameW = 600,
		messageFrameH = 300,
		yes = 100,
		no = 100,
		save = 100,
		delete = 100,
		add = 100,
		chooseInvitesW = 400,
		chooseInvitesH = 100,
		reject = 100,
		invite = 100,
		blackListW = 400,
		blackListH = 360,
		blackList = 150,
		uninviteW = 220,
		uninviteH = 160,
		customListW = 360,
		customListH = 360,
		customListBtn = 200,
		synchFrameW = 450,
		synchFrameH = 250,
		sendRequest = 150,
		synchBtn = 200,
		
		classLabel = 60,
		Ignore = 120,
		DeathKnight = 130,
		DemonHunter = 160,
		Druid = 70,
		Hunter = 80,
		Mage = 50,
		Monk = 70,
		Paladin = 80,
		Priest = 65,
		Rogue = 95,
		Shaman = 70,
		Warlock = 125,
		Warrior = 60,
		
		raceLabel = 60,
		Orc = 55,
		Undead = 80,
		Tauren = 75,
		Troll = 75,
		BloodElf = 100,
		Goblin = 75,
		Nightborne = 140,
		HightmountainTauren = 150,
		MagharOrc = 85,
		Pandaren = 95,
		Human = 100,
		Dwarf = 100,
		NightElf = 120,
		Gnome = 100,
		Draenei = 100,
		Worgen = 100,
		VoidElf = 130,
		LightforgedDraenei = 150,
		DarkIronDwarf = 160,
		ZandalariTroll = 120,
		KulTiran = 120,
		Mechagnome = 150,
		Vulpera = 120,
		
		
		filterNameLabel = 200,
		excludeNameLabel = 200,
		lvlRangeLabel = 200,
		excludeRepeatLabel = 200,
		saveButton = 100,
		
		scanFrameW = 260,
		scanFrameH = 105,
		confirmClearFrameW = 240,
		confirmClearFrameH = 80,
		inviteBTN = 120,
		clearBTN = 70,
	},
	Font = 'Interface\\AddOns\\FastGuildInvite\\fonts\\PT_Sans_Narrow.ttf',
	FontSize = 16,
}
